In [1]:
# SECTION 3: SQL Commands
'''
This section we will cover the 5 main types of SQL Commands, after completing this section you will be able to:
 * Perform Data Query Language operations using the SELECT command
 * Understand how to apply the distinct command
 * Perform Data Definition Language commands such as 
      - creating, 
      - dropping and 
      - altering tables and objects.

 * Understand the formatting differences between string and numerical values used as in query constraints and clauses.
 * Perform Data Manipulation Language Commands such as
    - inserting, 
    - updating and 
    - deleting records in a table
 * Use Data Control Language to 
    - grant 
    - revoke permissions within your schema
 * Get a high level overview of Transaction Control Language
 
The section will end with a series of practical Assignment Questions where you will be coding in SQL!
'''

'\nThis section we will cover the 5 main types of SQL Commands, after completing this section you will be able to:\n * Perform Data Query Language operations using the SELECT command\n * Understand how to apply the distinct command\n * Perform Data Definition Language commands such as \n      - creating, \n      - dropping and \n      - altering tables and objects.\n\n * Understand the formatting differences between string and numerical values used as in query constraints and clauses.\n * Perform Data Manipulation Language Commands such as\n    -  inserting, \n    - updating and \n    - deleting records in a table\n * Use Data Control Language to \n    - grant \n    - revoke permissions within your schema\n * Get a high level overview of Transaction Control Language\n \nThe section will end with a series of practical Assignment Questions where you will be coding in SQL!\n'

In [2]:
# The 5 Types of SQL Commands
'''
  - DDL 
  - DML 
  - DCL 
  - DQL
  - TCL
'''

'\n  - DDL \n  - DML \n  - DCL \n  - DQL\n  - TCL\n'

In [3]:
# Data Query Language : =>  DQL 
'''
 * SELECT COL_1, COL_2, COL_N FROM TABLE;
 * SELECT COL_1, COL_2, COL_N FROM SCHEMA.TABLE;

--- 
select 
  name, 
  population
FROM eba_countries;

--
select * FROM eba_countries;

-- case insesitive , 
select 
  name as country, 
  population,
  poPuLation
FROM eba_countries;

'''

'\n\nselect \n  name, \n  population\n\nFROM eba_countries;\n\nselect * FROM eba_countries;\n\n\n\n-- case insesitive , \nselect \n  name as country, \n  population,\n  poPuLation\n\nFROM eba_countries;\n\n'

In [2]:
# select Distinct statement, remove duplicates
'''
    select * FROM eba_countries;
    select distinct region_id FROM eba_countries;
    select distinct region_id,name FROM eba_countries;
    select distinct * FROM eba_countries;
'''

'\n    select * FROM eba_countries;\n    select distinct region_id FROM eba_countries;\n    select distinct region_id,name FROM eba_countries;\n    select distinct * FROM eba_countries;\n'

In [1]:
# Data Defintion Language (DDL)
'''
 create table test_table(
    col1 number , col2 varchar(50)
);

create table eba_countries_2 AS (
 select name , population from eba_countries
);

-- ALTER
alter table test_table add (new1 number, new2 varchar(50));
alter table test_table rename column new1 to new_altered;
alter table test_table drop (new_altered,new2);

-- RENAME
rename test_table to test_table_renamed;

-- TRUNCATE 
select * from eba_countries_2;
truncate table eba_countries_2;
'''

'\n create table test_table(\n    col1 number , col2 varchar(50)\n);\n\ncreate table eba_countries_2 AS (\n select name , population from eba_countries\n);\n\n-- ALTER\nalter table test_table add (new1 number, new2 varchar(50));\nalter table test_table rename column new1 to new_altered;\nalter table test_table drop (new_altered,new2);\n\n-RENAME\nrename test_table to test_table_renamed;\n\n\n-- TRUNCATE \nselect * from eba_countries_2;\ntruncate table eba_countries_2;\n\n'

In [2]:
# Note On String and Numerical Values
'''
 * Unlike numerical values, string values must be enclosed in single quotes.
 * This is also the case when referencing a string value in a condition or clause. You will see examples of this throughout the course.
 * In the next lecture we are inserting values into a table and you should note that all string values will be enclosed in single quotes.
 Numerical values do not need to be enclosed in single quotes unless they are stored as strings.
'''

'\n * Unlike numerical values, string values must be enclosed in single quotes.\n * This is also the case when referencing a string value in a condition or clause. You will see examples of this throughout the course.\n * In the next lecture we are inserting values into a table and you should note that all string values will be enclosed in single quotes.\n Numerical values do not need to be enclosed in single quotes unless they are stored as strings.\n'

In [7]:
# Data Manipulation Language => (DML)
'''
insert into eba_countries_2 (name, population) values('New Country', 1000);
insert into eba_countries_2 (name) values('New Country2');
insert into eba_countries_2 (population, name) values(20,'New Country3');
select * from eba_countries_2;
'''

"\n Get the PDF \n\n\ninsert into eba_countries_2 (name, population) values('New Country', 1000);\ninsert into eba_countries_2 (name) values('New Country2');\ninsert into eba_countries_2 (population, name) values(20,'New Country3');\nselect * from eba_countries_2;\n"

In [4]:
# Data Control Language (DCL) => GRANT & REVOKE
'''
-- schema1: WKSP_USER2 
select * FROM WKSP_ADVANCESQLRAJ.emp;

-- schema2: WKSP_ADVANCESQLRAJ
grant select on emp to WKSP_USER2;
revoke select on emp from WKSP_USER2;
'''

'\n-- schema1: WKSP_USER2 \nselect * FROM WKSP_ADVANCESQLRAJ.emp;\n\n-- schema2: WKSP_ADVANCESQLRAJ\ngrant select on emp to WKSP_USER2;\nrevoke select on emp from WKSP_USER2;\n'

In [5]:
# Transaction Control Language (TCL)
'''
* Transaction Control Language Commands are used to manage changes to transactions in a database.
* There are three commands you should be aware of:
  - COMMIT;
  - ROLLBACK;
  - SAVEPOINT optional_name;

* Note that on Oracle APEX all transactions are automatically committed so you cannot use TCL Commands in Oracle APEX. 
* You should be able to use TCL Commands on the main database management systems including Oracle SQL Developer, 
   MySQL and Microsoft SQL Server.

* I will however provide some details and example on the 3 commands in this article.

* COMMIT: This command commits the changes made to any transactions in the database. A transactional change could be the INSERT of a new 
record or the UPDATE or ALTER Commands for example.
'''

'\n* Transaction Control Language Commands are used to manage changes to transactions in a database.\n* There are three commands you should be aware of:\n  - COMMIT;\n  - ROLLBACK;\n  - SAVEPOINT optional_name;\n\n* Note that on Oracle APEX all transactions are automatically committed so you cannot use TCL Commands in Oracle APEX. \n* You should be able to use TCL Commands on the main database management systems including Oracle SQL Developer, \n   MySQL and Microsoft SQL Server.\n\n* I will however provide some details and example on the 3 commands in this article.\n\n* COMMIT: This command commits the changes made to any transactions in the database. A transactional change could be the INSERT of a new \nrecord or the UPDATE or ALTER Commands for example.\n'

In [6]:
# Assignment Questions
# Please attempt as many questions as you can, I will go over the solutions in the next lecture. Good luck!
# (For these assignment questions we will be using the Countries Sample Dataset)

'''
Q1) For this question I want you to create a table by using the existing records from the "EBA_COUNTRIES" Table.
Create a new table by using the “COUNTRY_ID” and “POPULATION” fields from the "EBA_COUNTRIES" table and 
name the new table “Customer Age".

create table customer_age as (
 select COUNTRY_ID, POPULATION from eba_countries
)
create table "Customer Age" as (select country_id, population from eba_countries);


'''

'\nQ1) For this question I want you to create a table by using the existing records from the "EBA_COUNTRIES" Table.\nCreate a new table by using the “COUNTRY_ID” and “POPULATION” fields from the "EBA_COUNTRIES" table and \nname the new table “Customer Age".\n\ncreate table customer_age as (\n select COUNTRY_ID, POPULATION from eba_countries\n)\ncreate table "Customer Age" as (select country_id, population from eba_countries);\n\n\n'

In [8]:
# Q2) Truncate the newly created “Customer Age” table
'''
truncate table customer_age;
truncate table "Customer Age";
'''

#Q3) In your "Customer Age" table rename the ”COUNTRY_ID” field to “NAME”
'''
 - alter table customer_age rename column country_id  to name;
 - alter table "Customer Age" rename column country_id to Name;
'''

# Q4) Rename the ”POPULATION” field to “AGE”
'''
 - alter table customer_age rename column ”POPULATION”  to “AGE”;
 - alter table "Customer Age" rename column Population to Age;
'''

# Q5) Slightly more challenging, Insert a new record into the ”CUSTOMER AGE” table: Carlos aged 32.
# (Hint, look at the data types for the “CUSTOMER AGE” table)
'''
 alter table customer_age modify( name  varchar2(30));
 insert into customer_age values('carlos', 32);

 alter table "Customer Age" modify Name varchar(50);
 insert into "Customer Age" (Name, Age) values ('Carlos', 32);
'''

'\n alter table customer_age modify( name  varchar2(30));\n insert into customer_age values(\'carlos\', 32);\n\n alter table "Customer Age" modify Name varchar(50);\n insert into "Customer Age" (Name, Age) values (\'Carlos\', 32);\n'

In [9]:
# Invalid Number : If we try to insert string in integer value